import { RequiredTranslationDict } from "../api/types"

const ru: RequiredTranslationDict = {
    HEADING: {
        HOME: () => "Главная",
        PORTFOLIO: () => "Портфолио",
    },
    MAIN_PAGE: {
        SKILLS_PROGRAMMING: () => "Языки",
        SKILLS_LANGUAGE: () => "Программирования",
        REALISED: () => "Реализованные",
        PROJECTS: () => "Проекты",
        YEARS_OF: () => "Лет опыта",
        TITLE1: () => "Современные решения для вашего бизнеса",
        TITLE2: () => " Современные инновационные решения в области информационных технологий ",
        TECHNOLOGY: () => ["Web and mobile", "Telegram mini apps", "Smart contracts", 'Telegram bots'],
        TEAM_TITLE: () => "Наша команда",
        TEAM_SUBTITLE: () => "Мы команда из опытных разработчиков и дизайнеров",
        INTRODUCTION_TITLE: () => "Знакомство",
        INTRODUCTION_SUBTITLE: () => "От идеи до реализации, Мы всегда готовы помочь вам создать свой проект на любом этапе реализации",
        ABOUT_US: () => "Обо мне",
        HELLO: () => "Привет!",
        TEAM_ABOUT: () => "Я разработчик с более чем с 5 летним опытом, специализируюсь на высокопроизводительных полнофункциональных приложениях для корпоративных решений, блокчейн технологий и финансовых решений",
        TEAM_DESCRIPTION: () => "Помогу вам разработать проект под ключ. Понимаю как из вашей идеи сформировать масштабируемое и отзывчивое приложение, будь то традиционный веб-интерфейс, telegram mini apps или мобильная разработка",
        WHY_CHOOSE_US: () => "Почему выбирают меня?",
        ACCHIEVMENT_1: () => "Подтвержденный опыт: Мое портфолио включает более 8 успешных проектов",
        ACCHIEVMENT_2: () => "Гибкость в разработке: Готов вам помочь на любом этапе вашего проекта — будь то создание приложения с нуля, интеграция сложных функций или оптимизация производительности.",
        ACCHIEVMENT_3: () => "Разнообразный технологический стек: Я работаю с широким спектром технологий, что позволяет нам находить лучшие решения для ваших потребностей",
        ACCHIEVMENT_4: () =>  "Давайте создадим нечто удивительное вместе! Свяжитесь со мной, чтобы обсудить, как я могу помочь вам и бизнесу расти и процветать",
        OUR_WORKS_TITLE: () => "Портфолио",
        OUR_WORKS_SUBTITLE: () => "Вот несколько примеров моих последних работ",
        CONTACT_US_TITLE: () => "Свяжитесь со мной",
        CONTACT_US_SUBTITLE: () => "Я всегда открыт для ваших проектов и идей",
        SEND_MESSAGE_BUTTON: () => "Отправить сообщение",
        YOUR_NAME: () => "Ваше имя",
        YOUR_EMAIL: () => "Ваш email",
        YOUR_MESSAGE: () => "Ваше сообщение",
        MINTY_TITLE: () => "Minty",
        MINTY_DESCRIPTION: () => "DEFI биржа Minty. Разработка проекта с нуля заняла менее 3 месяцев. Внедрены все необходимые функции, такие как обмен, вывод средств и управление кошельком. Используется React, Redux, Node.js, MongoDB и Ethereum. Проект успешно запущен и работает в сети SOLANA.",
        SHELTER_TITLE: () => "Shelter",
        SHELTER_DESCRIPTION: () => "Маркетплейс Shelter. Разработка с нуля заняла менее 5 месяцев. Shelter - это полноценный маркетплейс для поиска, продажи и покупки животных. Оплату можно совершать через cloudpayments через пластиковую карту, либо с искользованием криптовалюты через TON Connect",
    }
}

export {
    ru
}